<template>
  <a-page-header
      :breadcrumb="{ routes }"
      title="版权页面"
  >
    <a-descriptions-item>
      <div class="text-mount-pink">
        账户管理，包括账户的增删改查，账户的状态，账户的创建时间，账户的更新时间，账户是否已被删除等。
      </div>
    </a-descriptions-item>
  </a-page-header>
  <div class="grid grid-cols-12 p-3">
    <div class="col-span-12">
      <a-card class="shadow-lg p-6">
        <a-form
            class="grid grid-cols-12"
            name="basic"
        >
          <a-form-item
              class="col-span-12"
              label="版权说明"
              name="desc"
          >
            <a-textarea v-model:value="copyright" :rows="20"></a-textarea>
          </a-form-item>
          <div class="col-span-12 text-center">
            <a-button class="bg-aspargus" type="primary">保存更改</a-button>
          </div>
        </a-form>
      </a-card>
    </div>
  </div>
</template>
<script setup>
import {ref} from "vue";

const copyright = ref('### 法律声明及绿链碳账本网站访问条件\n' +
    '\n' +
    '以下规则（以下简称“使用条款”）适用于所有访问绿链碳账本网站的用户或浏览者。绿链碳账本团队保留随时修改这些规则的权利。访问绿链碳账本网站的权利由我们根据以下条款授予。如果您不同意以下任何条款，请停止使用本网站。对于违反这些规则的行为，绿链碳账本有权采取法律和公平的补救措施。\n' +
    '\n' +
    '### 绿链碳账本网站内容\n' +
    '\n' +
    '本网站所载的材料和信息，包括但不限于文本、图片、数据、观点、建议，旨在提供准确的材料和信息。尽管如此，绿链碳账本并不保证这些材料和内容的准确性、完整性，并且明确声明不承担因这些材料和内容的任何错误或遗漏而产生的责任。\n' +
    '\n' +
    '绿链碳账本可以在没有任何通知或提示的情况下随时对网站内容进行修改。为获取最新信息，请定时访问本网站。本网站提及的非绿链碳账本产品或服务仅为提供相关信息，并不构成对这些产品、服务的认可或推荐。\n' +
    '\n' +
    '### 软件使用\n' +
    '\n' +
    '本网站上所有相关软件的所有权归绿链碳账本所有，除非与绿链碳账本或其关联公司的相关协议另有规定，否则不授予任何形式的使用许可。您同意不进行任何可能侵犯软件及其内部实现的行为。\n' +
    '\n' +
    '### 您的使用权利\n' +
    '\n' +
    '您承诺遵守所有适用的法律法规以及本使用条款。您同意不会以任何方式损害网站的正常运作或其他用户的合法权益。\n' +
    '\n' +
    '### 商标及著作权\n' +
    '\n' +
    '本网站所有商标、标志归绿链碳账本所有。未经绿链碳账本事先书面许可，任何内容不得被用于任何商业目的或公开传播。\n' +
    '\n' +
    '### 隐私保护\n' +
    '\n' +
    '绿链碳账本尊重并保护所有使用网站用户的个人隐私权，您在使用网站服务时提供的注册信息及其他个人信息将受到严格保护。\n' +
    '\n' +
    '### 第三方链接\n' +
    '\n' +
    '本网站可能包含第三方网站或链接，这些链接的提供仅为方便用户。访问这些链接由用户自行决定，我们不保证这些链接上信息的准确性和完整性。\n' +
    '\n' +
    '### 免责声明\n' +
    '\n' +
    '绿链碳账本对于因使用本网站或链接的第三方网站信息而导致的任何直接、间接损失不承担责任。\n' +
    '\n' +
    '### 适用法律\n' +
    '\n' +
    '您同意本网站使用条款及其解释、变更、执行和争议解决均适用中华人民共和国法律，并受中华人民共和国法院的管辖。\n' +
    '\n' +
    '### 最终解释权\n' +
    '\n' +
    '对于本声明和绿链碳账本的使用，绿链碳账本保留最终解释权。')
</script>